# from get_profession_list import get_prof_list

professions = {
    "Вербальный":[
        "рекламист",
        "специалист по PR",
        "копирайтер в рекламном или маркетинговом агентстве",
        "адвокат",
        "учитель русского (или любого другого) языка",
        "юрист",
        "политик",
        "научный сотрудник",
        "логопед",
        "поэт",
        "писатель"
    ],
    
    "Музыкальный":[
        "дирижёр",
        "композитор",
        "певец",
        "изготовитель музыкальных инструментов",
        "учитель музыки",
        "музыкант",
        "настройщик фортепиано",
        "аранжировщик"
    ],
    
    "Логический":[
        "бухгалтер",
        "банкир",
        "экономист",
        "инженер (механик, электротехник, строитель, химик)",
        "программист",
        "преподаватель научных дисциплин",
        "учёный (биолог, химик, физик, астроном, геолог, ботаник, океанолог)",
        "врач",
        "социолог",
        "менеджер по закупкам",
        "судмедэксперт"
    ],
    
    "Образный":[
        "учитель рисования",
        "строитель",
        "дизайнер",
        "учитель геометрии/тригонометрии",
        "изобретатель",
        "кадастровый инженер",
        "архитектор",
        "художник",
        "специалист по рекламе",
        "оформитель витрин"
    ],
    
    "Телесный":[
        "строитель",
        "мастер-ремесленник (гончар, стеклодув, ткач, корзинщик и прочие)",
        "ювелир",
        "механик",
        "учитель физкультуры",
        "профессиональный спортсмен",
        "скульптор",
        "стоматолог",
        "плотник",
        "парикмахер",
        "дирижёр",
        "военный",
        "спасатель",
        "пожарный"
    ],

    "Социальный":[
        "психолог",
        "владелец собственного бизнеса",
        "политик",
        "продавец",
        "учитель",
        "общественный активист",
        "социолог",
        "директор по рекламе",
        "полицейский",
        "директор компании",
        "медсестра/медбрат",
        "менеджер магазина",
        "управляющий рестораном/отелем",
        "адвокат",
        "психотерапевт"
    ],

    "Внутренний":[
        "ремесленник",
        "изобретатель",
        "предприниматель",
        "учитель",
        "инвестор",
        "коуч",
        "руководитель (в бизнесе, политике, общественной деятельности)",
        "художник",
        "профессор",
        "психолог",
        "поэт",
        "писатель",
        "психиатр"
    ],
    
    "Природный":[
        "учёный (астроном, биолог)",
        "природоохранный активист",
        "юрист, специализирующийся на экологии",
        "ландшафтный дизайнер",
        "пчеловод",
        "садовод",
        "повар",
        "учитель биологии/химии",
        "судмедэксперт",
        "ветеринар"
    ],
    
    "Философский":[
        "предприниматель в сфере здорового образа жизни",
        "коуч",
        "философ",
        "учитель истории религии",
        "психолог",
        "теолог",
        "художник",
        "иглорефлексотерапевт",
        "преподаватель медитации",
        "священник, служитель церкви",
        "парапсихолог"
    ],
    


    "учитель":[
        "учитель",
        "преподаватель",
        "психолог",
        "учёный",
        "врач",
        "художник",
        "коуч",
        "философ",
        "медсестра/медбрат",
        "логопед",
        "социолог",
        "профессор",
        "поэт",
        "писатель",
        "судмедэксперт",
        "ветеринар",
        "терапевт",
        "священник, служитель церкви",
        "теолог",
        "психиатр",
        "музыкант",
        "композитор",
        "певец"
    ],
    
    "воин":[
        "юрист",
        "спортсмен",
        "руководитель",
        "директор",
        "дирижёр",
        "военный",
        "спасатель",
        "пожарный",
        "менеджер",
        "управляющий",
        "адвокат",
        "полицейский",
        "бизнес"
    ],
    
    "торговец":[
        "рекламист",    
        "специалист по PR",
        "продавец",
        "предприниматель",
        "бухгалтер",
        "банкир",
        "экономист",
        "директор по рекламе",
        "специалист по рекламе",
        "маркетинг"
        "инвестор"
    ],
    
    "мастер":[
        "инженер",
        "ремесленник",
        "дизайнер",
        "строитель",
        "архитектор",
        "стоматолог",
        "плотник",
        "парикмахер",
        "ювелир",
        "оформитель витрин",
        "изобретатель",
        "повар",
        "изготовитель",
        "настройщик"
    ]
}

# if __name__ == "__main__":
#     print(get_prof_list(professions["Философский"], professions["учитель"]))